.config/emacs/config.org
#+TITLE: Emacs Configuration
#+AUTHOR: Pushkar Raj
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+STARTUP: overview

* Basic setup
** figure out the system type

#+begin_src emacs-lisp
  (defconst my-gnu/linux-laptop-p
    (and (equal system-type 'gnu/linux)
         (eq (string-search "android" system-configuration) nil))
    "If the value is t, emacs is running on my gnu/linux laptop.")

  (defconst my-android-phone-p
    (not (eq (string-search "android" system-configuration) nil))
    "If the value is t, emacs is running inside termux, on my android phone.")

  (defconst my-windows-laptop-p
    (equal system-type 'windows-nt)
    "If the value is t, emacs is running on my windows laptop.")
#+end_src

** garbage collection threshold

Set =gc-cons-threshold= to a higher value for less frequent garbage collections during startup.

#+begin_src emacs-lisp
  (setq gc-cons-threshold (* 64 1000000))
#+end_src

** native compilation

If emacs is built with native-compilation support, set the load path for natively compiled =*.eln= files and suppress the warnings caused while async native compilation process.

#+begin_src emacs-lisp
  (when (native-comp-available-p)
    (setq native-comp-async-report-warnings-errors nil)
    ;; (setq native-comp-async-report-warnings-errors 'silent)
    (add-to-list 'native-comp-eln-load-path
                 (expand-file-name "eln-cache/"
                                   user-emacs-directory)))
#+end_src

** replace yes-or-no with y-or-n

#+begin_src emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p)
#+end_src

** UTF-8 encoding

Set preferred and default character encodings to UTF-8.

#+begin_src emacs-lisp
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
#+end_src

** echo keystrokes immediately

Show keystrokes immediately in the echo area.

#+begin_src emacs-lisp
  (setq echo-keystrokes 0.01)
#+end_src

** minimal look

#+begin_src emacs-lisp
  (menu-bar-mode -1)
  (column-number-mode)

  (unless my-android-phone-p
    (tool-bar-mode -1)
    (tooltip-mode -1)
    (set-fringe-mode 10)
    (scroll-bar-mode -1))

  (setq inhibit-startup-screen t
        scroll-conservatively 101)

  ;; prevent the annoying bell sounds
  (setq visible-bell t)
#+end_src

** scratch buffer

Start the =*scratch*= buffer in =fundamental-mode= instead of =emacs-lisp= mode.

#+begin_src emacs-lisp
  (setq initial-major-mode 'fundamental-mode)
  (setq initial-scratch-message "")
#+end_src

*** bury =*scratch*= buffer instead of killing it

Bury =*scratch*= buffer instead of killing it. Kill other buffers immediately.

#+begin_src emacs-lisp
  (defun my-kill-current-buffer ()
    "Bury *scratch* buffer instead of killing it. Kill other buffers immediately."
    (interactive)
    (if (equal (buffer-name) "*scratch*")
        (bury-buffer)
      (kill-buffer (current-buffer))))

  (global-set-key (kbd "C-x k") 'my-kill-current-buffer)
#+end_src

** frame transparency

Make the frame a little transparent on my =GNU/Linux= laptop.

#+begin_src emacs-lisp
  (when my-gnu/linux-laptop-p
    (set-frame-parameter (selected-frame) 'alpha '(95 . 95))
    (add-to-list 'default-frame-alist `(alpha . (95 . 95))))
#+end_src

** font setup

#+begin_src emacs-lisp
  (setq my-fixed-pitch-font "Cascadia Code")
  (setq my-variable-pitch-font "Open Sans")

  (defun my-set-font-faces ()
    "Set font faces."
    (set-face-attribute 'default nil
                        :font my-fixed-pitch-font
                        :weight 'normal
                        :height 110)

    (set-face-attribute 'fixed-pitch nil
                        :font my-fixed-pitch-font
                        :weight 'regular
                        :height 1.0)

    (set-face-attribute 'variable-pitch  nil
                        :font my-variable-pitch-font
                        :height 1.0))

  (my-set-font-faces)
#+end_src

** handle whitespaces

Cycle between single-space, no-space and original text, around the point by repeatedly pressing =M-SPC=.

Delete trailing whitespaces before saving a buffer.

#+begin_src emacs-lisp
  (global-set-key (kbd "M-SPC")
                  (lambda ()
                    "Instruct `cycle-spacing' to delete newlines too."
                    (interactive)
                    (cycle-spacing -1)))

  (add-hook 'before-save-hook
            'delete-trailing-whitespace)
#+end_src

** registers

#+begin_src emacs-lisp
  (set-register ?E `(file . ,(concat
                              (file-name-as-directory
                               user-emacs-directory)
                              "config.org")))

  (when my-gnu/linux-laptop-p
    (set-register ?Q '(file . "~/.config/qtile/qtile.org"))
    (set-register ?B '(file . "~/.local/data/bookmarks")))

  (when my-windows-laptop-p
    (set-register ?B '(file . "~/bookmarks.txt")))
#+end_src

** unbind =C-z=

#+begin_src emacs-lisp
  (global-unset-key (kbd "C-z"))
#+end_src

* Package archives
** elpa & melpa setup

#+begin_src emacs-lisp
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents (package-refresh-contents))
#+end_src

** use-package

#+begin_src emacs-lisp
  (when (< emacs-major-version 29)
    (unless (package-installed-p 'use-package)
      (package-install 'use-package)))

  (require 'use-package)
  (setq use-package-always-ensure t)
  (setq use-package-verbose t)
#+end_src

* No littering

Keep the emacs directory clean, and put all backup files in a single place.

#+begin_src emacs-lisp
  (use-package no-littering)

  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

  (setq backup-directory-alist
        `(("." . ,(no-littering-expand-var-file-name "backup/"))))

  ;; prevent Emacs form littering into init.el
  (setq custom-file (no-littering-expand-etc-file-name "custom.el"))
#+end_src

* Aesthetics
** icons

#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p)
    :config
    (setq all-the-icons-scale-factor 1.25))

  (use-package nerd-icons
    :config
    (setq nerd-icons-scale-factor 1.25))
#+end_src

** doom themes and modeline

#+begin_src emacs-lisp
  (defvar my-light-theme 'doom-gruvbox-light)
  (defvar my-dark-theme 'doom-dracula)
  (defvar my-current-theme-variant 'dark)

  (defun my-toggle-theme ()
    "Toggle between light and dark themes, set by variables `my-light-theme'
  and `my-dark-theme'"
    (interactive)
    (if (eq my-current-theme-variant 'dark)
        (progn
          (disable-theme my-dark-theme)
          (load-theme my-light-theme t)
          (setq my-current-theme-variant 'light))
      (disable-theme my-light-theme)
      (load-theme my-dark-theme t)
      (setq my-current-theme-variant 'dark))
    (message "OK: %s theme activated" (symbol-name my-current-theme-variant)))

  (use-package doom-themes
    :config
    (setq doom-themes-enable-bold t)
    (setq doom-themes-enable-italic t)
    (load-theme (if (eq my-current-theme-variant 'dark)
                    my-dark-theme
                  my-light-theme) t)
    (set-face-attribute 'font-lock-comment-face  nil
                        :slant 'italic))

  (use-package doom-modeline
    :config
    (setq doom-modeline-icon t)
    (setq doom-modeline-height 12))
    (doom-modeline-mode 1)
#+end_src

** dashboard

#+begin_src emacs-lisp
  (use-package dashboard
    :config
    (dashboard-setup-startup-hook)
    :init
    (setq dashboard-startup-banner 'logo)
    (setq dashboard-center-content t)
    (setq dashboard-set-heading-icons t)
    (setq dashboard-icon-type 'all-the-icons)
    (setq dashboard-set-file-icons t)
    (setq dashboard-set-init-info t)
    (setq dashboard-projects-backend 'project-el)
    (setq dashboard-items '((recents  . 3)
                            (projects . 5)
                            (registers . 3))))

  ;;(use-package dashboard)
#+end_src

* Completion system
** mini-buffer history

#+begin_src emacs-lisp
  (use-package savehist
    :config
    (setq history-length 25)
    (savehist-mode 1))
#+end_src

** vertico

#+begin_src emacs-lisp
  (use-package vertico
    :config
    (setq vertico-cycle t)
    (setq vertico-resize t)
    (vertico-mode)
    (vertico-reverse-mode))
#+end_src

** orderless

#+begin_src emacs-lisp
  (use-package orderless
    :init
    (setq completion-styles '(orderless)
          completion-category-defaults nil
          completion-category-overrides
          '((file (styles . (partial-completion))))))
#+end_src

** marginalia

#+begin_src emacs-lisp
  (use-package marginalia
    :after vertico
    :config
    (setq marginalia-align 'right)
    (setq marginalia-annotators '(marginalia-annotators-heavy
                                  marginalia-annotators-light nil))
    (marginalia-mode))
#+end_src

* Window management
