.config/emacs/config.org
** ace-window

#+begin_src emacs-lisp
  (use-package ace-window
    :bind ("M-o" . ace-window)
    :config
    (set-face-attribute 'aw-leading-char-face nil
                        :font my-fixed-pitch-font
                        :weight 'bold
                        :slant 'normal
                        :foreground "yellow"
                        :height 200)
    :custom
    (aw-keys '(?j ?k ?l ?f ?g ?h ?a ?s ?d ?i ?e ?n ?m)))
#+end_src

** winner-mode

Undo/Redo window configuration with =C-c <left>= and =C-c <right>=.

#+begin_src emacs-lisp
  (winner-mode)
#+end_src

** width/height thresholds

Prefer vertical splits on wide screens.
Split vertically if width >= 145 characters

#+begin_src emacs-lisp
  (setq split-height-threshold nil)
  (setq split-width-threshold 145)
#+end_src

** side windows

#+begin_src emacs-lisp
  (setq display-buffer-alist
        `((,(concat "\\*.*"
                    "\\(Backtrace"
                    "\\|Compile-Log"
                    "\\|compilation"
                    "\\|Warnings"
                    "\\|Compile-Log"
                    "\\|compilation"
                    "\\|Calendar"
                    "\\|Flycheck"
                    "\\|Flymake"
                    "\\|vterm"
                    "\\).*\\*")
           (display-buffer-in-side-window)
           (window-height . 0.25)
           (side . bottom))))
#+end_src

** window divider

#+begin_src emacs-lisp
  (setq-default window-divider-default-places t)
  (setq-default window-divider-default-bottom-width 2)
  (setq-default window-divider-default-right-width 2)
  (window-divider-mode t)
  (set-face-attribute 'window-divider nil
                      :foreground "#b16e75")
#+end_src

* Org mode
** org fonts

#+begin_src emacs-lisp
  (defun my-org-font-face-setup ()
    "Set necessary font faces in `org-mode'."

    (dolist (face '((org-level-1 . 1.25)
                    (org-level-2 . 1.15)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.0)
                    (org-level-6 . 1.0)
                    (org-level-7 . 1.0)
                    (org-level-8 . 1.0)))
      (set-face-attribute (car face) nil
                          :height (cdr face)
                          :weight 'bold))

    ;; fixed-pitch face setup
    (dolist (face '(org-table
                    org-formula org-block
                    org-code org-verbatim
                    org-checkbox line-number
                    org-special-keyword
                    line-number-current-line))
      (set-face-attribute face nil :inherit 'fixed-pitch))

    (dolist (face '(org-table
                    org-document-info-keyword
                    org-meta-line))
      (set-face-attribute face nil
                          :foreground nil
                          :inherit '(shadow fixed-pitch))))
#+end_src

** org

#+begin_src emacs-lisp
  (use-package org
    :pin org
    :commands
    (org-capture org-agenda)
    :hook
    (org-mode . (lambda ()
                  (my-org-font-face-setup)
                  (if my-gnu/linux-laptop-p (flyspell-mode))
                  (org-indent-mode)
                  (visual-line-mode 1)))
    :config
    (setq org-directory "~/Org")
    (setq org-ellipsis " ▾")
    (setq org-hide-emphasis-markers t)
    (setq org-startup-folded 'overview)
    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)
    (advice-add 'org-refile
                :after 'org-save-all-org-buffers)

    ;; Add a clock sound for `org-timer-set-timer'
    (let ((sound-file "~/.local/data/bell.wav"))
      (if (file-exists-p sound-file)
          (setq org-clock-sound sound-file))))
#+end_src

** org capture

#+begin_src emacs-lisp
  (global-set-key (kbd "C-c c") #'org-capture)

  (setq org-capture-templates
        `( ("t" "Todo item" entry
            (file+headline "inbox.org" "Tasks")
            ,(concat "* %^{|TODO|BLOG|SOMEDAY} %^{Title}\n"
                     ":PROPERTIES:\n"
                     ":CREATED: %U\n"
                     ":END:\n"
                     "Note: %?\n"))

           ("i" "Project idea" entry
            (file+headline "inbox.org" "Project Ideas")
            ,(concat "* PROJECT %^{Title}\n"
                     ":PROPERTIES:\n"
                     ":CREATED: %U\n"
                     ":END:\n"
                     "Note: %?\n"))

           ("n" "Quick note" entry
            (file+headline "inbox.org" "Quick Notes")
            ,(concat "* %^{Title}\n"
                     ":PROPERTIES:\n"
                     ":CREATED: %U\n"
                     ":END:\n"
                     "Note: %?")
            :empty-lines-after 1)

           ("r" "Reading list item" entry
            (file+headline "inbox.org" "Reading List")
            ,(concat "* READ %^{Description}\n"
                     ":PROPERTIES:\n"
                     ":CREATED: %U\n"
                     ":TOPIC: %^{Topic}\n"
                     ":END:\n"
                     "URL: %(current-kill 0)\n"
                     "Note: %?\n")
            :empty-lines-after 1)))
#+end_src

** org agenda

#+begin_src emacs-lisp
  (global-set-key (kbd "C-c a") #'org-agenda)

  (setq org-agenda-files '("~/Org/inbox.org"))
  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (setq org-todo-keywords
        '((sequence "TODO(t)" "SOMEDAY(s)" "|" "DONE(x!)")
          (sequence "READ(r)" "BLOG(b)" "PROJECT(p)" "|" "DONE(x!)")))

  (setq org-enforce-todo-dependencies t)
  (setq org-track-ordered-property-with-tag t)
  (setq org-agenda-dim-blocked-tasks t)
#+end_src

*** TODO org custom agenda

#+begin_src emacs-lisp

#+end_src

** org bullets

#+begin_src emacs-lisp
  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉")))
#+end_src

** structure templates

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (require 'org-tempo)
    (dolist (language '(("el" . "src emacs-lisp")
                        ("py" . "src python")
                        ("sh" . "src shell")
                        ("js" . "src js")))
      (add-to-list 'org-structure-template-alist language)))
#+end_src

** org babel languages

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((python . t)
       (emacs-lisp . t))))

  (setq org-confirm-babel-evaluate nil)
#+end_src

* Development setup
** prog-mode-hook

#+begin_src emacs-lisp
  (setq c-basic-offset 2) ;; defined in cc.el
  (add-hook 'prog-mode-hook
            (lambda ()
              ;;(local-set-key (kbd "C-<tab>") 'yas-expand)
              ;; (set-fringe-style 8)
              (hl-line-mode)
              (electric-pair-local-mode)))
#+end_src

** project management

#+begin_src emacs-lisp
  (use-package project
    :demand t)

  (use-package magit
    :commands magit-status
    :config
    (setq magit-display-buffer-function
          #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

** completions with =company-mode=

Enable =company-mode= in =prog-mode=, =text-mode=, and =org-mode= buffers.  Company mode can be enabled globally with =M-x global-company-mode RET=.

#+begin_src emacs-lisp
  (use-package company
    :commands (company-mode global-company-mode)
    :hook (prog-mode text-mode org-mode)
    :bind
    (:map company-active-map
          ("<tab>" . company-complete-selection))
    :config
    (setq company-minimum-prefix-length 2)
    (setq company-idle-delay 0.2))
#+end_src

** syntax checking with =flycheck-mode=

The documentation for =flycheck-mode= can be found on their website https://flycheck.org.  You can also run =M-x flycheck-manual RET= to open it in your web browser.

#+begin_src emacs-lisp
  (use-package flycheck
    :commands (global-flycheck-mode flycheck-mode)
    :hook prog-mode)
#+end_src

** snippets

#+begin_src emacs-lisp
  (use-package yasnippet
    :requires warnings  ;; for `warning-suppress-types' below
    :config
    (setq yas-snippet-dirs
          `( ,(concat user-emacs-directory "snippets")))
    (add-to-list 'warning-suppress-types '(yasnippet backquote-change))
    (yas-global-mode 1)
    (yas-reload-all))
#+end_src

** language server protocol

*** eglot

https://joaotavora.github.io/eglot

#+begin_src emacs-lisp
  (use-package eglot
    :ensure nil
    :commands eglot
    :autoload eglot-ensure
    :hook ((c-mode c++-mode python-mode) . eglot-ensure))
#+end_src

