.config/emacs/config.org
*** lsp-mode

=lsp-mode= is disabled, trying out the built-in =eglot= mode instead.

#+begin_src emacs-lisp
  (use-package lsp-mode
    :disabled t
    :commands (lsp lsp-deferred)
    :hook
    (my-lsp-enabled-modes . lsp)
    :init
    (setq lsp-headerline-breadcrumb-enable 'nil)
    (setq lsp-keymap-prefix "C-c l")
    :config
    (setq-default lsp-clients-clangd-args
                  '("--cross-file-rename"
                    "--enable-config"
                    "--fallback-style=WebKit"
                    "--clang-tidy"
                    "--clang-tidy-checks='*'"
                    "--suggest-missing-includes"
                    "--header-insertion=iwyu"
                    "--header-insertion-decorators=0")))

  (use-package lsp-ui
    :disabled t
    :after lsp-mode)
#+end_src

** Multiple cursors

#+begin_src emacs-lisp
  (use-package multiple-cursors
    :bind
    ("C-S-c C-S-c" . mc/edit-lines)
    ("C->" . mc/mark-next-like-this)
    ("C-<" . mc/mark-previous-like-this)
    ("C-c C-<" . mc/mark-all-like-this))
#+end_src

** Language specific configurations
*** html

Examples on how to use =emmet-mode= can be found at https://github.com/smihica/emmet-mode.

#+begin_src emacs-lisp
  (use-package web-mode
    :mode ("\\.html?$" "\\.djhtml$" "\\.mustache\\'" "\\.phtml\\'"
            "\\.as[cp]x\\'" "\\.erb\\'" "\\.hbs\\'")
    :config
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-code-indent-offset 2)
    (setq web-mode-enable-html-entities-fontification t)
    (setq web-mode-enable-current-column-highlight t)
    (setq web-mode-auto-close-style 2))

  (use-package emmet-mode
    :hook (web-mode css-mode sgml-mode))
#+end_src

*** python

#+begin_src emacs-lisp
  (use-package python
    :interpreter
    ("python" . python-mode)
    ("python3" . python-mode))

  (use-package pyvenv
    :after python
    :hook python-mode)
#+end_src

*** javascript/typescript

#+begin_src emacs-lisp
  (use-package js
    :interpreter "node"
    :init
    (setq js-jsx-syntax t)
    :config
    (setq js-indent-level 2))

  (use-package typescript-mode
    :mode "\\.ts\\'"
    :config
    (setq typescript-indent-level 2))
#+end_src

*** emacs-lisp

#+begin_src emacs-lisp
  (add-hook 'emacs-lisp-mode-hook
            (lambda ()
              (setq-local company-backends
                          '(company-elisp
                            company-files
                            company-yasnippet))
              (company-mode)))
#+end_src

*** java

#+begin_src emacs-lisp
  (use-package lsp-java
    :disabled t
    :after lsp-mode
    :hook
    (java-mode . lsp))
#+end_src

#+begin_src emacs-lisp
  (use-package eglot-java
    ;; :hook java-mode
    :bind
    (:map eglot-java-mode-map
          ("C-c l n" . eglot-java-file-new)
          ("C-c l x" . eglot-java-run-main)
          ("C-c l t" . eglot-java-run-test)
          ("C-c l N" . eglot-java-project-new)
          ("C-c l T" . eglot-java-project-build-task)
          ("C-c l R" . eglot-java-project-build-refresh)))
#+end_src

**** Formatting java buffers

 #+begin_src emacs-lisp
   (defvar my-google-java-format-jar-file
     (concat (file-name-as-directory (concat user-emacs-directory "var"))
             "google-java-format.jar")
     "Complete path of the google java formatter jar file.")

   (defun my-download-google-java-format-jar-file ()
     "Download the google java formatter jar file from github."
     (interactive)
     (url-copy-file "https://github.com/google/google-java-format/releases/download/v1.16.0/google-java-format-1.16.0-all-deps.jar"
                    my-google-java-format-jar-file 1))

   (defun my-format-java-buffer ()
     "Format current java buffer to comply with google style."
     (interactive nil 'java-mode)
     (let ((temp-buffer (generate-new-buffer "*java-format*"))
           (temp-file (make-temp-file "java-format-error" nil))
           ;; Always use 'utf-8-unix' & ignore the buffer coding system.
           (default-process-coding-system '(utf-8-unix . utf-8-unix)))
       (call-process-region nil nil "java" nil
                            `(,temp-buffer ,temp-file) nil
                            "-jar" my-google-java-format-jar-file "-")
       (if (> (buffer-size temp-buffer) 0)
           ;; Replace buffer with formatted code
           (replace-buffer-contents temp-buffer)
         (message "Error: could not format current buffer!"))
       (kill-buffer temp-buffer)
       (delete-file temp-file)))
#+end_src

** Auto format buffers using =format-all=

#+begin_src emacs-lisp
  (use-package format-all
    :commands (format-all-buffer format-all-region format-all-mode)
    :autoload fomat-all-ensure-formatter
    :hook
    (prog-mode . format-all-ensure-formatter)
    :config
    (setq-default format-all-formatters
                  '(("C" (clang-format "-style=file"))
                    ("C++" (clang-format "-style=file"
                                         "--fallback-style=WebKit"))
                    ("CSS" prettier)
                    ("Emacs Lisp" emacs-lisp)
                    ("Go" gofmt)
                    ("Java" (clang-format "-style=file"))
                    ("JavaScript" prettier)
                    ("Markdown" prettier)
                    ("Python" black)
                    ("TypeScript" prettier))))
#+end_src

** Make REST API calls using =restclient=

#+begin_src emacs-lisp
  (use-package restclient
    :commands (restclient-mode))
#+end_src

* Tweaks with some built-in modes
** dired

#+begin_src emacs-lisp
  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump)
           ("C-x C-d" . dired))
    :hook
    (dired-mode . dired-hide-details-mode)
    :config
    (setq dired-listing-switches "-lhAX --group-directories-first"))


  (use-package all-the-icons-dired
    :commands all-the-icons-dired-mode
    :hook
    (dired-mode . (lambda ()
                    (if (window-system)
                        (all-the-icons-dired-mode)))))
#+end_src

** tab-bar-mode

#+begin_src emacs-lisp
  (use-package tab-bar
    :ensure nil
    :config
    ;; set better faces for tabs
    ;; (set-face-attribute 'tab-bar nil :inherit 'mode-line)
    ;; (set-face-attribute 'tab-bar-tab nil
    ;;                     :weight 'bold
    ;;                     :slant 'italic
    ;;                     :underline t
    ;;                     :foreground "#aaee77")
    ;; (set-face-attribute 'tab-bar-tab-inactive nil
    ;;                     :slant 'italic
    ;;                     :foreground "#afafaf")
    (setq tab-bar-show nil)  ;; don't show the tab-bar
    (setq tab-bar-new-tab-choice t) ;; open the current buffer in new tab
    (setq tab-bar-close-button-show nil)
    (setq tab-bar-new-button-show nil)
    (setq tab-bar-close-last-tab-choice 'tab-bar-mode-disable))
#+end_src

** ibuffer

#+begin_src emacs-lisp
  (global-unset-key (kbd "C-x C-b"))
  (global-set-key (kbd "C-x C-b") 'ibuffer)
#+end_src

* Center buffers with olivetti-mode

#+begin_src emacs-lisp
  (unless my-android-phone-p
    (use-package olivetti
      :commands olivetti-mode
      :hook
      (org-mode Info-mode)
      :config
      (set-default 'olivetti-body-width 100)))
#+end_src

* elfeed

#+begin_src emacs-lisp
  (use-package elfeed
    :hook
    (elfeed-show-mode . visual-line-mode)
    :config
    (set-face-attribute 'elfeed-search-unread-title-face nil
                        :font my-fixed-pitch-font
                        :slant 'italic
                        :weight 'bold)
    (setq elfeed-feeds
     '("http://nullprogram.com/feed/"
       "https://levelofindirection.com/main.rss"
       "https://blog.petrzemek.net/feed/"
       "https://planet.emacslife.com/atom.xml")))
#+end_src

* Use IRC with =erc=

#+begin_src emacs-lisp
  (use-package erc
    :commands
    (erc-tls erc)
    :config
    (setq erc-server "irc.libera.chat")
    (setq erc-port 6697)
    (setq erc-prompt (lambda () (concat (buffer-name) ">")))
    (setq erc-nick "px86")
    (setq erc-fill-column 100))
#+end_src

* Other little tweaks
