.config/emacs/init.el

(use-package pulse
  :ensure nil  ; built-in package
  :autoload
  (pulse-momentary-highlight-one-line pulse-momentary-highlight-region)
  :config
  (setq pulse-flag t)
  (setq pulse-delay 0.04)
  (set-face-attribute 'pulse-highlight-start-face nil
                      :background "#87ceeb"))


(dolist (command '(scroll-up-command
                   scroll-down-command
                   recenter-top-bottom
                   other-window
                   isearch-repeat-forward
                   isearch-repeat-backward
                   ace-window))
  (advice-add command :after
              (lambda (&rest args)
                "Momentarily highlight current line."
                (pulse-momentary-highlight-one-line (point)))))


(advice-add 'kill-ring-save :after
            (lambda (&rest args)
              "Momentarily highlight currently active region, otherwise the current line."
              (if mark-active
                  (pulse-momentary-highlight-region (region-beginning) (region-end))
                (pulse-momentary-highlight-one-line (point)))))

(when my-gnu/linux-laptop-p
  ;; needed for vc-git-root function
  (require 'vc-git)

  (defun my-launch-terminal ()
    "Launch a terminal in project root or in current working directory."
    (interactive)
    (let* ((term (getenv "TERMINAL"))
           (terminal (if term term "xterm"))
           (filename (buffer-file-name))
           (dir (if filename
                    (vc-git-root filename)
                  nil))
           (default-directory (or dir
                                  default-directory)))
      (start-process "Terminal" nil terminal)))

  (defun my-launch-terminal-in-cwd ()
    "Launch a terminal in the current working directory."
    (interactive)
    (let* ((term (getenv "TERMINAL"))
           (terminal (if term term "xterm")))
      (start-process "Terminal" nil terminal)))

  (global-set-key (kbd "s-t") #'my-launch-terminal))

(defun my-normalize-string-for-filename (string)
  "Downcase and remove special charactes from string."
  (downcase (string-join
             (split-string string
                           "[] ~!@#$%^&*()+={}[\\|/;:,.'\"<>?]+" t "[ _-]") "-")))

(defun my-filter-list (predicate list)
  "Filter LIST items through the PREDICATE function."
  (let ((newlist '()))
    (dolist (item list)
      (if (funcall predicate item)
          (push item newlist)))
    newlist))


(defvar my-full-name "Pushkar Raj" "My full name")
(defvar my-email "px86@protonmail.com" "My email address.")
(defvar my-blog-dir
  (expand-file-name "~/Programming/repos/px86.github.io")
  "My blog's root directory.")

(defun my-new-blog-post ()
  "Create a new blog post."
  (interactive)
  (let* ((folder (completing-read "Select blog subfolder: "
                                  (my-filter-list
                                   (lambda (f)
                                     (and (file-directory-p f)
                                          (not (member (file-name-base f)
                                                       '("." ".." "assets")))))
                                   (directory-files (expand-file-name "source" my-blog-dir) t))
                                  nil t))
         (title (read-string (format "[%s] Title: " (file-name-base folder))))
         (subtitle (read-string "Subtitle: " ))
         (filename (concat (my-normalize-string-for-filename title) ".org"))
         (filepath (expand-file-name filename folder)))
    (if (file-exists-p filepath)
        "Error: Oops! file already exists"
      (find-file filepath)
      (insert (format
               (concat
                "#+TITLE: %s\n"
                "#+SUBTITLE: %s\n"
                "#+AUTHOR: %s\n"
                "#+EMAIL: %s\n"
                "#+DATE: %s\n\n")
               title
               subtitle
               my-full-name
               my-email
               (format-time-string "[%Y-%m-%d %a]"))))))

(setq initial-buffer-choice
      (lambda () (get-buffer "*dashboard*")))

(add-hook 'server-after-make-frame-hook
                       #'my-set-font-faces)

;; Lower the GC threshold, again
(setq gc-cons-threshold 16000000)
